{
  "education": [
    {
      "awards_achievements": [
        "Scholarship",
        "Dean's List (2015, 2016): Ut enim ad minim veniam",
        "GPA: 3.8/4.0"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Science and Engineering",
      "duration": "2018-2021",
      "school_name": "Ryerson university"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2016-2018",
      "school_name": "XYZ university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AliSaboohi",
  "highlighted_projects": [
    {
      "description": "Designed and Developed Online clothing Web site with Online Shopping facility. using Java and Spring Boot for backend and React Js for Frontend. Frontend developed as SPA application in order to use Client Computer Resources using JavaScript ES6 Version, Vanilla JavaScript, Babel, React-Dom-route, Redux, HTML and CSS, in Backend using Spring Core for dependency Injection and AOP, Spring MVC to develop Rest Endpoints (RestController Bean) and JSON. implementing Data Entity Classes and using  Hibernate, Spring Data JPA, JPA QL for managing Data and store it in MySQL Database",
      "git_url": null,
      "name": "Clothing Store Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Objective of this project was to design an MVP in order to gather hardware specifications and resource usage of each node in a Linux cluster. In Jarvis, the Linux cluster administration team manages a Linux cluster of ten nodes running Centos7. These nodes are internally connected through a switch and able to communicate through internal IPv4 addresses. The administration team has requested a bash agent program that is installed on each node and gathers the requested data. The collected data is inserted into a Postgres database instance which is pulled from Docker Hub. Moreover, the LCA team will use the data to generate reports for future resource planning purposes. In order to make decision making easier, a queries file has been created for the administration team to see what nodes have the highest memory and number of CPUs, what is their usage over a five minute interval and detecting failures.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Ali Saboohi",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming",
        "Volunteer, ABC Food bank: Ut enim ad minim veniam"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "XYZ Company",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2019",
      "title": "Tutor"
    }
  ],
  "skills": {
    "competent": [
      "Donec",
      "fermentum",
      "Donec",
      "fermentum",
      "Donec"
    ],
    "familiar": [
      "Matlab",
      "Python",
      "ReactJS",
      "MongoDB",
      "Node.js"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Hi, I'm a recent computer science graduate from Ryerson university. During the four years my main focus was on backend development, machine learning and computer vision. In Jarvis, I became proficient in technologies such as git, docker, Java ,RDBMS/SQL, Hadoop, Spark etc. Looking forward to become a Big Data Engineer."
}
