{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Computer Science",
      "department": "Science and Engineering",
      "duration": "2018-2021",
      "school_name": "Ryerson university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AliSaboohi",
  "highlighted_projects": [
    {
      "description": "Designed and Developed an online clothing e-commerce website. The frontend was developed using JavaScript ES6 Version, Vanilla JavaScript, Babel, React-Dom-route, Redux, HTML and CSS. The backend was developed using Spring Core for dependency Injection and AOP, Spring MVC to build Rest Endpoints and JSON. Implemented Data Entity Classes using Hibernate, Spring Data JPA, JPA QL to manage and store data in MySQL Database.",
      "git_url": null,
      "name": "Clothing Store Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster monitoring agent using bash scripts to collect hardware information and usage of each node in real-time. The collected information is persisted into a PostgreSQL database instance provisioned using a Docker container. The usage is being collected continuously using crontab. Additionally, wrote SQL queries to query data for later data analysis, failure detection as an example.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Ali Saboohi",
  "others": [
    {
      "bullets": [
        "Tennis player",
        "Soccer fan",
        "Gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a Software and Data engineering team in an Agile environment to work on various projects using technologies, tools and frameworks such as git, Maven, Java, PostgresSQL, IntelliJ, Docker, etc. Organized daily scrum meetings as well as bi-weekly sprint retrospectives. Studied and practiced new technologies and better ways to develop better solutions to real-world problems.",
      "duration": "2020-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Spring Boot",
      "REST API",
      "JDBC",
      "Docker",
      "Maven"
    ],
    "familiar": [
      "Matlab",
      "Python",
      "ReactJS",
      "MongoDB",
      "Node.js"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I'm a recent graduate from Ryerson University with a bachelor's degree in Computer Science. During my four years at Ryerson, my main focus was on backend development, machine learning and computer vision, where I worked on many projects such as Face Detection application using HOG features, Handwrite Recognition application and created a few websites. Currently, I am a Software and Data Engineer at Jarvis, where I am trained to master the tools and frameworks necessary for a professional work environment such as Git, Docker, Java, Spring boot, RDBMS, Maven etc. In addition to this, I have a passion for the insights data can provide. My experiences taught me how to come up with creative solutions to real-world problems, and I am looking forward to bringing my experiences and skills to your team."
}
